import {z} from "zod";

export const userSchema = z.object({
    name: z
        .string()
        .nonempty("نام الزامی است")
        .max(100, "نام نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد"),
    username: z
        .string()
        .nonempty("نام کاربری الزامی است")
        .min(3, "نام کاربری باید حداقل ۳ کاراکتر باشد")
        .max(30, "نام کاربری نمی‌تواند بیشتر از ۳۰ کاراکتر باشد")
        .regex(
            /^[a-zA-Z0-9]+$/,
            "نام کاربری فقط می‌تواند شامل حروف انگلیسی و اعداد باشد"
        ),

    email: z
        .string()
        .nonempty("ایمیل الزامی است")
        .email("فرمت ایمیل صحیح نیست"),

    city: z
        .string()
        .nonempty("نام شهر الزامی است")
        .max(50, "نام شهر نمی‌تواند بیشتر از ۵۰ کاراکتر باشد"),
});